apache/nuttx/arch/arm/src/imxrt/imxrt_flexio.c
/****************************************************************************
 * arch/arm/src/imxrt/imxrt_flexio.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <assert.h>
#include <nuttx/debug.h>

#include <arch/barriers.h>
#include <arch/board/board.h>

#include <nuttx/arch.h>
#include <nuttx/wdog.h>
#include <nuttx/clock.h>
#include <nuttx/kmalloc.h>
#include <nuttx/mutex.h>

#include "arm_internal.h"

#include "imxrt_gpio.h"
#include "imxrt_periphclks.h"
#include "imxrt_flexio.h"
#include "hardware/imxrt_flexio.h"

#ifdef CONFIG_IMXRT_FLEXIO

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* The state of the FlexIO controller. */

struct imxrt_flexiodev_s
{
  struct flexio_dev_s     flexio;       /* Externally visible part of the FlexIO interface */
  uint32_t                base;         /* FlexIO controller register base address */
  bool                    initialized;  /* TRUE: Controller has been initialized */
};

struct flexio_config_s
{
  bool enable_flexio;                   /* Enable/disable FlexIO module */
  bool enable_indoze;                   /* Enable/disable FlexIO operation in doze mode */
  bool enable_indebug;                  /* Enable/disable FlexIO operation in debug mode */
  bool enable_fast_access;              /* Enable/disable fast access to FlexIO registers, fast access requires
                                         * the FlexIO clock to be at least twice the frequency of the bus clock. */
};

static void imxrt_flexio_reset(struct flexio_dev_s *dev);
static void imxrt_flexio_enable(struct flexio_dev_s *dev, bool enable);
static uint32_t imxrt_flexio_read_pin_input(struct flexio_dev_s *dev);
static uint8_t imxrt_flexio_get_shifter_state(struct flexio_dev_s *dev);
static void imxrt_flexio_set_shifter_config(struct flexio_dev_s *dev,
              uint8_t index,
              const struct flexio_shifter_config_s *shifter_config);
static void imxrt_flexio_set_timer_config(struct flexio_dev_s *dev,
              uint8_t index,
              const struct flexio_timer_config_s *timer_config);
static void imxrt_flexio_set_clock_mode(struct flexio_dev_s *dev,
              uint8_t index,
              enum flexio_timer_decrement_source_e clocksource);
static void imxrt_flexio_enable_shifter_status_interrupts(
              struct flexio_dev_s *dev, uint32_t mask);
static void imxrt_flexio_disable_shifter_status_interrupts(
              struct flexio_dev_s *dev, uint32_t mask);
static void imxrt_flexio_enable_shifter_error_interrupts(
              struct flexio_dev_s *dev, uint32_t mask);
static void imxrt_flexio_disable_shifter_error_interrupts(
              struct flexio_dev_s *dev, uint32_t mask);
static void imxrt_flexio_enable_timer_status_interrupts(
              struct flexio_dev_s *dev, uint32_t mask);
static void imxrt_flexio_disable_timer_status_interrupts(
              struct flexio_dev_s *dev, uint32_t mask);
static uint32_t imxrt_flexio_get_shifter_status_flags(
              struct flexio_dev_s *dev);
static void imxrt_flexio_clear_shifter_status_flags(
              struct flexio_dev_s *dev, uint32_t mask);
static uint32_t imxrt_flexio_get_shifter_error_flags(
                  struct flexio_dev_s *dev);
static void imxrt_flexio_clear_shifter_error_flags(
              struct flexio_dev_s *dev, uint32_t mask);
static uint32_t imxrt_flexio_get_timer_status_flags(
                  struct flexio_dev_s *dev);
static void imxrt_flexio_clear_timer_status_flags(
              struct flexio_dev_s *dev, uint32_t mask);
static void imxrt_flexio_enable_shifter_status_dma(
              struct flexio_dev_s *dev, uint32_t mask, bool enable);
static uint32_t imxrt_flexio_get_shifter_buffer_address(
                  struct flexio_dev_s *dev,
                  enum flexio_shifter_buffer_type_e type, uint8_t index);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct flexio_ops_s g_flexio_ops =
{
  .reset = imxrt_flexio_reset,
  .enable = imxrt_flexio_enable,
  .read_pin_input = imxrt_flexio_read_pin_input,
  .get_shifter_state = imxrt_flexio_get_shifter_state,
  .set_clock_mode = imxrt_flexio_set_clock_mode,
  .enable_shifter_status_interrupts =
  imxrt_flexio_enable_shifter_status_interrupts,
  .disable_shifter_status_interrupts =
  imxrt_flexio_disable_shifter_status_interrupts,
  .enable_shifter_error_interrupts =
  imxrt_flexio_enable_shifter_error_interrupts,
  .disable_shifter_error_interrupts =
  imxrt_flexio_disable_shifter_error_interrupts,
  .enable_timer_status_interrupts =
  imxrt_flexio_enable_timer_status_interrupts,
  .disable_timer_status_interrupts =
  imxrt_flexio_disable_timer_status_interrupts,
  .get_shifter_status_flags = imxrt_flexio_get_shifter_status_flags,
  .clear_shifter_status_flags = imxrt_flexio_clear_shifter_status_flags,
  .get_shifter_error_flags = imxrt_flexio_get_shifter_error_flags,
  .clear_shifter_error_flags = imxrt_flexio_clear_shifter_error_flags,
  .get_timer_status_flags = imxrt_flexio_get_timer_status_flags,
  .clear_timer_status_flags = imxrt_flexio_clear_timer_status_flags,
  .enable_shifter_status_dma = imxrt_flexio_enable_shifter_status_dma,
  .get_shifter_buffer_address = imxrt_flexio_get_shifter_buffer_address,
  .set_shifter_config = imxrt_flexio_set_shifter_config,
  .set_timer_config = imxrt_flexio_set_timer_config,
};

#ifdef CONFIG_IMXRT_FLEXIO1
static struct imxrt_flexiodev_s g_flexio1_dev =
{
  .flexio =
  {
    .ops = &g_flexio_ops,
  },
  .base = IMXRT_FLEXIO1_BASE,
};
#endif

