apache/nuttx/arch/arm/src/imxrt/imxrt_flexio.c
#ifdef CONFIG_IMXRT_FLEXIO2
static struct imxrt_flexiodev_s g_flexio2_dev =
{
  .flexio =
  {
    .ops = &g_flexio_ops,
  },
  .base = IMXRT_FLEXIO2_BASE,
};
#endif

#ifdef CONFIG_IMXRT_FLEXIO3
static struct imxrt_flexiodev_s g_flexio3_dev =
{
  .flexio =
  {
    .ops = &g_flexio_ops,
  },
  .base = IMXRT_FLEXIO3_BASE,
};
#endif

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Utility functions */

static inline uint32_t imxrt_flexio_getreg32(struct flexio_dev_s *dev,
                                             uint32_t offset);
static inline void imxrt_flexio_putreg32(struct flexio_dev_s *dev,
                                         uint32_t value, uint32_t offset);

static inline void imxrt_flexio_modifyreg32(struct flexio_dev_s *dev,
                                            unsigned int offset,
                                            uint32_t clearbits,
                                            uint32_t setbits);

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: imxrt_flexio_getreg32
 *
 * Description:
 *   Get the contents of the ENET register at offset
 *
 * Input Parameters:
 *   dev    - private FlexIO device structure
 *   offset - offset to the register of interest
 *
 * Returned Value:
 *   The contents of the 32-bit register
 *
 ****************************************************************************/

static inline uint32_t imxrt_flexio_getreg32(struct flexio_dev_s *dev,
                                             uint32_t offset)
{
  return getreg32(((struct imxrt_flexiodev_s *)dev)->base + offset);
}

/****************************************************************************
 * Name: imxrt_flexio_putreg32
 *
 * Description:
 *   Atomically modify the specified bits in a memory mapped register
 *
 * Input Parameters:
 *   dev       - private FlexIO device structure
 *   offset    - offset to the register of interest
 *   clearbits - the 32-bit value to be written as 0s
 *   setbits   - the 32-bit value to be written as 1s
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void imxrt_flexio_modifyreg32(struct flexio_dev_s *dev,
                                            unsigned int offset,
                                            uint32_t clearbits,
                                            uint32_t setbits)
{
  modifyreg32(((struct imxrt_flexiodev_s *)dev)->base + offset, clearbits,
              setbits);
}

/****************************************************************************
 * Name: imxrt_flexio_putreg32
 *
 * Description:
 *   Write a value to the FlexIO register at offset
 *
 * Input Parameters:
 *   dev    - private FlexIO device structure
 *   value  - the 32-bit value to be written
 *   offset - offset to the register of interest
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void imxrt_flexio_putreg32(struct flexio_dev_s *dev,
                                         uint32_t value, uint32_t offset)
{
  putreg32(value, ((struct imxrt_flexiodev_s *)dev)->base + offset);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/* Resets the FlexIO module.
 *
 * param dev FlexIO device
 */

static void imxrt_flexio_reset(struct flexio_dev_s *dev)
{
  /* do software reset, software reset operation affect all other FLEXIO
   * registers except CTRL
   */

  imxrt_flexio_modifyreg32(dev, IMXRT_FLEXIO_CTRL_OFFSET, 0,
                           FLEXIO_CTRL_SWRST_MASK);
  imxrt_flexio_putreg32(dev, 0, IMXRT_FLEXIO_CTRL_OFFSET);
}

/* Enables the FlexIO module operation.
 *
 * param dev FlexIO device
 * param enable true to enable, false to disable.
 */

static void imxrt_flexio_enable(struct flexio_dev_s *dev, bool enable)
{
  if (enable)
    {
      imxrt_flexio_modifyreg32(dev, IMXRT_FLEXIO_CTRL_OFFSET, 0,
                               FLEXIO_CTRL_FLEXEN_MASK);
    }
  else
    {
      imxrt_flexio_modifyreg32(dev, IMXRT_FLEXIO_CTRL_OFFSET,
                               FLEXIO_CTRL_FLEXEN_MASK, 0);
    }
}

/* Reads the input data on each of the FlexIO pins.
 *
 * param dev FlexIO device
 * return FlexIO pin input data
 */

static uint32_t imxrt_flexio_read_pin_input(struct flexio_dev_s *dev)
{
  uint32_t regval;

  regval = imxrt_flexio_getreg32(dev, IMXRT_FLEXIO_PIN_OFFSET);

  return regval;
}

/* Gets the current state pointer for state mode use.
 *
 * param dev FlexIO device
 * return current State pointer
 */

static uint8_t imxrt_flexio_get_shifter_state(struct flexio_dev_s *dev)
{
  uint32_t regval;

  regval = imxrt_flexio_getreg32(dev, IMXRT_FLEXIO_SHIFTSTATE_OFFSET);

  return ((uint8_t)regval & FLEXIO_SHIFTSTATE_STATE_MASK);
}

/* Configures the shifter with the shifter configuration. The configuration
 * structure covers both the SHIFTCTL and SHIFTCFG registers. To configure
 * the shifter to the proper mode, select which timer controls the shifter
 * to shift, whether to generate start bit/stop bit, and the polarity of
 * start bit and stop bit.
 *
 * Example
 * code
 * struct flexio_shifter_config_s config = {
 * .timer_select = 0,
 * .timer_polarity = FLEXIO_SHIFTER_TIMER_POLARITY_ON_POSITIVE,
 * .pin_config = FLEXIO_PIN_CONFIG_OPEN_DRAIN_OR_BIDIRECTION,
 * .pin_polarity = FLEXIO_PIN_ACTIVE_LOW,
 * .shifter_mode = FLEXIO_SHIFTER_MODE_TRANSMIT,
 * .input_source = FLEXIO_SHIFTER_INPUT_FROM_PIN,
 * .shifter_stop = FLEXIO_SHIFTER_STOP_BIT_HIGH,
 * .shifter_start = FLEXIO_SHIFTER_START_BIT_LOW
 * };
 * imxrt_flexio_set_shifter_config(dev, &config);
 * endcode
 *
 * param dev FlexIO device address
 * param index Shifter index
 * param shifter_config Pointer to flexio_shifter_config_s structure
 */

static void imxrt_flexio_set_shifter_config(struct flexio_dev_s *dev,
                                            uint8_t index,
              const struct flexio_shifter_config_s *shifter_config)
{
  uint32_t regval;

  regval =
    FLEXIO_SHIFTCFG_INSRC(shifter_config->input_source) |
    FLEXIO_SHIFTCFG_PWIDTH(shifter_config->parallel_width) |
    FLEXIO_SHIFTCFG_SSTOP(shifter_config->shifter_stop) |
    FLEXIO_SHIFTCFG_SSTART(shifter_config->shifter_start);

  imxrt_flexio_putreg32(dev, regval,
                        IMXRT_FLEXIO_SHIFTCFG0_OFFSET + index * 0x4);

  regval =
    FLEXIO_SHIFTCTL_TIMSEL(shifter_config->timer_select) |
    FLEXIO_SHIFTCTL_TIMPOL(shifter_config->timer_polarity) |
    FLEXIO_SHIFTCTL_PINCFG(shifter_config->pin_config) |
    FLEXIO_SHIFTCTL_PINSEL(shifter_config->pin_select) |
    FLEXIO_SHIFTCTL_PINPOL(shifter_config->pin_polarity) |
    FLEXIO_SHIFTCTL_SMOD(shifter_config->shifter_mode);

  imxrt_flexio_putreg32(dev, regval,
                        IMXRT_FLEXIO_SHIFTCTL0_OFFSET + index * 0x4);
}

/* Configures the timer with the timer configuration. The configuration
 * structure covers both the TIMCTL and TIMCFG registers. To configure the
 * timer to the proper mode, select trigger source for timer and the timer
 * pin output and the timing for timer.
 *
 * Example
 * code
 * struct flexio_timer_config_s config = {
 * .trigger_select = FLEXIO_TIMER_TRIGGER_SEL_SHIFTnSTAT(0),
 * .trigger_polarity = FLEXIO_TIMER_TRIGGER_POLARITY_ACTIVE_LOW,
 * .trigger_source = FLEXIO_TIMER_TRIGGER_SOURCE_INTERNAL,
 * .pin_config = FLEXIO_PIN_CONFIG_OPEN_DRAIN_OR_BIDIRECTION,
 * .pin_select = 0,
 * .pin_polarity = FLEXIO_PIN_ACTIVE_HIGH,
 * .timer_mode = FLEXIO_TIMER_MODE_DUAL8_BIT_BAUD_BIT,
 * .timer_output = FLEXIO_TIMER_OUTPUT_ZERO_NOT_AFFECTED_BY_RESET,
 * .timer_decrement =
 *    FLEXIO_TIMER_DEC_SRC_ON_FLEX_IO_CLOCK_SHIFT_TIMER_OUTPUT,
 * .timer_reset = FLEXIO_TIMER_RESET_ON_TIMER_PIN_EQUAL_TO_TIMER_OUTPUT,
 * .timer_disable = FLEXIO_TIMER_DISABLE_ON_TIMER_COMPARE,
 * .timer_enable = FLEXIO_TIMER_ENABLE_ON_TRIGGER_HIGH,
 * .timer_stop = FLEXIO_TIMER_STOP_BIT_ENABLE_ON_TIMER_DISABLE,
 * .timer_start = FLEXIO_TIMER_START_BIT_ENABLED
 * };
 * imxrt_flexio_set_timer_config(dev, &config);
 * endcode
 *
 * param dev FlexIO peripheral dev address
 * param index Timer index
 * param timer_config Pointer to the flexio_timer_config_s structure
 */

