apache/nuttx/arch/arm/src/imxrt/imxrt_flexio.c
static void imxrt_flexio_set_timer_config(struct flexio_dev_s *dev,
                                          uint8_t index,
              const struct flexio_timer_config_s *timer_config)
{
  uint32_t regval;

  regval =
    FLEXIO_TIMCFG_TIMOUT(timer_config->timer_output) |
    FLEXIO_TIMCFG_TIMDEC(timer_config->timer_decrement) |
    FLEXIO_TIMCFG_TIMRST(timer_config->timer_reset) |
    FLEXIO_TIMCFG_TIMDIS(timer_config->timer_disable) |
    FLEXIO_TIMCFG_TIMENA(timer_config->timer_enable) |
    FLEXIO_TIMCFG_TSTOP(timer_config->timer_stop) |
    FLEXIO_TIMCFG_TSTART(timer_config->timer_start);

  imxrt_flexio_putreg32(dev, regval,
                        IMXRT_FLEXIO_TIMCFG0_OFFSET + index * 0x4);

  regval = FLEXIO_TIMCMP_CMP(timer_config->timer_compare);

  imxrt_flexio_putreg32(dev, regval,
                        IMXRT_FLEXIO_TIMCMP0_OFFSET + index * 0x4);

  regval =
    FLEXIO_TIMCTL_TRGSEL(timer_config->trigger_select) |
    FLEXIO_TIMCTL_TRGPOL(timer_config->trigger_polarity) |
    FLEXIO_TIMCTL_TRGSRC(timer_config->trigger_source) |
    FLEXIO_TIMCTL_PINCFG(timer_config->pin_config) |
    FLEXIO_TIMCTL_PINSEL(timer_config->pin_select) |
    FLEXIO_TIMCTL_PINPOL(timer_config->pin_polarity) |
    FLEXIO_TIMCTL_TIMOD(timer_config->timer_mode);

  imxrt_flexio_putreg32(dev, regval,
                        IMXRT_FLEXIO_TIMCTL0_OFFSET + index * 0x4);
}

/* This function set the value of the prescaler on flexio channels
 *
 * param base Pointer to the FlexIO simulated peripheral type.
 * param clocksource Set clock value
 */

static void imxrt_flexio_set_clock_mode(struct flexio_dev_s *dev,
                                        uint8_t index,
              enum flexio_timer_decrement_source_e clocksource)
{
  imxrt_flexio_modifyreg32(dev, IMXRT_FLEXIO_TIMCFG0_OFFSET + index * 0x4,
                           FLEXIO_TIMCFG_TIMDEC_MASK,
                           FLEXIO_TIMCFG_TIMDEC(clocksource));
}

/* Enables the shifter status interrupt. The interrupt generates when the
 * corresponding SSF is set.
 *
 * param dev FlexIO device
 * param mask The shifter status mask which can be calculated by
 * (1 << shifter index)
 * note For multiple shifter status interrupt enable, for example, two
 * shifter status enable, can calculate the mask by using
 * ((1 << shifter index0) | (1 << shifter index1))
 */

static void imxrt_flexio_enable_shifter_status_interrupts(
              struct flexio_dev_s *dev, uint32_t mask)
{
  imxrt_flexio_modifyreg32(dev, IMXRT_FLEXIO_SHIFTSIEN_OFFSET, 0, mask);
}

/* Disables the shifter status interrupt. The interrupt won't generate when
 * the corresponding SSF is set.
 *
 * param dev FlexIO device
 * param mask The shifter status mask which can be calculated by
 *            (1 << shifter index)
 * note For multiple shifter status interrupt enable, for example, two
 *      shifter status enable, can calculate the mask by using
 *      ((1 << shifter index0) | (1 << shifter index1))
 */

static void imxrt_flexio_disable_shifter_status_interrupts(
              struct flexio_dev_s *dev, uint32_t mask)
{
  imxrt_flexio_modifyreg32(dev, IMXRT_FLEXIO_SHIFTSIEN_OFFSET, mask, 0);
}

/* Enables the shifter error interrupt. The interrupt generates when the
 * corresponding SEF is set.
 *
 * param dev FlexIO device
 * param mask The shifter error mask which can be calculated by
 *            (1 << shifter index)
 * note For multiple shifter error interrupt enable, for example, two shifter
 *      error enable, can calculate the mask by using ((1 << shifter index0)
 *      | (1 << shifter index1))
 */

static void imxrt_flexio_enable_shifter_error_interrupts(
              struct flexio_dev_s *dev, uint32_t mask)
{
  imxrt_flexio_modifyreg32(dev, IMXRT_FLEXIO_SHIFTEIEN_OFFSET, 0, mask);
}

/* Disables the shifter error interrupt. The interrupt won't generate when
 * the corresponding SEF is set.
 *
 * param dev FlexIO device
 * param mask The shifter error mask which can be calculated by
 *            (1 << shifter index)
 * note For multiple shifter error interrupt enable, for example, two shifter
 *      error enable, can calculate the mask by using ((1 << shifter index0)
 *      | (1 << shifter index1))
 */

static void imxrt_flexio_disable_shifter_error_interrupts(
              struct flexio_dev_s *dev, uint32_t mask)
{
  imxrt_flexio_modifyreg32(dev, IMXRT_FLEXIO_SHIFTEIEN_OFFSET, mask, 0);
}

/* Enables the timer status interrupt. The interrupt generates when the
 * corresponding SSF is set.
 *
 * param dev FlexIO device
 * param mask The timer status mask which can be calculated by
 *            (1 << timer index)
 * note For multiple timer status interrupt enable, for example, two timer
 *      status enable, can calculate the mask by using ((1 << timer index0) |
 *      (1 << timer index1))
 */

static void imxrt_flexio_enable_timer_status_interrupts(
              struct flexio_dev_s *dev, uint32_t mask)
{
  imxrt_flexio_modifyreg32(dev, IMXRT_FLEXIO_TIMIEN_OFFSET, 0, mask);
}

/* Disables the timer status interrupt. The interrupt won't generate when the
 * corresponding SSF is set.
 *
 * param dev FlexIO device
 * param mask The timer status mask which can be calculated by
 *            (1 << timer index)
 * note For multiple timer status interrupt enable, for example, two timer
 *      status enable, can calculate the mask by using ((1 << timer index0) |
 *      (1 << timer index1))
 */

static void imxrt_flexio_disable_timer_status_interrupts(
              struct flexio_dev_s *dev, uint32_t mask)
{
  imxrt_flexio_modifyreg32(dev, IMXRT_FLEXIO_TIMIEN_OFFSET, mask, 0);
}

/* Gets the shifter status flags.
 *
 * param dev FlexIO device
 * return Shifter status flags
 */

static uint32_t imxrt_flexio_get_shifter_status_flags(
                  struct flexio_dev_s *dev)
{
  uint32_t regval;

  regval = imxrt_flexio_getreg32(dev, IMXRT_FLEXIO_SHIFTSTAT_OFFSET);

  return (regval & FLEXIO_SHIFTSTAT_SSF_MASK);
}

/* Clears the shifter status flags.
 *
 * param dev FlexIO device
 * param mask The shifter status mask which can be calculated by
 *            (1 << shifter index)
 * note For clearing multiple shifter status flags, for example, two shifter
 *      status flags, can calculate the mask by using ((1 << shifter index0)
 *      | (1 << shifter index1))
 */

