apache/nuttx/arch/arm/src/imxrt/imxrt_flexio.c
static void imxrt_flexio_clear_shifter_status_flags(
              struct flexio_dev_s *dev, uint32_t mask)
{
  imxrt_flexio_putreg32(dev, mask, IMXRT_FLEXIO_SHIFTSTAT_OFFSET);
}

/* Gets the shifter error flags.
 *
 * param dev FlexIO device
 * return Shifter error flags
 */

static uint32_t imxrt_flexio_get_shifter_error_flags(
                  struct flexio_dev_s *dev)
{
  uint32_t regval;

  regval = imxrt_flexio_getreg32(dev, IMXRT_FLEXIO_SHIFTERR_OFFSET);

  return (regval & FLEXIO_SHIFTERR_SEF_MASK);
}

/* Clears the shifter error flags.
 *
 * param dev FlexIO device
 * param mask The shifter error mask which can be calculated by
 *            (1 << shifter index)
 *
 * note For clearing multiple shifter error flags, for example, two shifter
 * error flags, can calculate the mask by using ((1 << shifter index0) |
 * (1 << shifter index1))
 */

static void imxrt_flexio_clear_shifter_error_flags(struct flexio_dev_s *dev,
                                                   uint32_t mask)
{
  imxrt_flexio_putreg32(dev, mask, IMXRT_FLEXIO_SHIFTERR_OFFSET);
}

/* Gets the timer status flags.
 *
 * param dev FlexIO device
 * return Timer status flags
 */

static uint32_t imxrt_flexio_get_timer_status_flags(struct flexio_dev_s *dev)
{
  uint32_t regval;

  regval = imxrt_flexio_getreg32(dev, IMXRT_FLEXIO_TIMSTAT_OFFSET);

  return (regval & FLEXIO_TIMSTAT_TSF_MASK);
}

/* Clears the timer status flags.
 *
 * param dev FlexIO device
 * param mask The timer status mask which can be calculated by
 *            (1 << timer index)
 *
 * note For clearing multiple timer status flags, for example, two timer
 * status flags, can calculate the mask by using ((1 << timer index0) |
 * (1 << timer index1))
 */

static void imxrt_flexio_clear_timer_status_flags(struct flexio_dev_s *dev,
                                                  uint32_t mask)
{
  imxrt_flexio_putreg32(dev, mask, IMXRT_FLEXIO_TIMSTAT_OFFSET);
}

/* Enables/disables the shifter status DMA. The DMA request generates when
 * the corresponding SSF is set.
 *
 * For multiple shifter status DMA enables, for example, calculate
 * the mask by using ((1 << shifter index0) | (1 << shifter index1))
 *
 * param dev FlexIO device
 * param mask The shifter status mask which can be calculated by
 *            (1 << shifter index)
 * param enable True to enable, false to disable.
 */

static void imxrt_flexio_enable_shifter_status_dma(struct flexio_dev_s *dev,
                                                  uint32_t mask, bool enable)
{
  if (enable)
    {
      imxrt_flexio_modifyreg32(dev, IMXRT_FLEXIO_SHIFTSDEN_OFFSET, 0, mask);
    }
  else
    {
      imxrt_flexio_modifyreg32(dev, IMXRT_FLEXIO_SHIFTSDEN_OFFSET, mask, 0);
    }
}

/* Configures the FlexIO with a FlexIO configuration. The configuration
 * structure can be filled by the user or be set with default values by
 * imxrt_flexio_get_default_config().
 *
 * Example
 * code
 * struct flexio_config_s config = {
 * .enable_flexio = true,
 * .enable_indoze = false,
 * .enable_indebug = true,
 * .enable_fast_access = false
 * };
 * imxrt_flexio_init(base, &config);
 * endcode
 *
 * param dev FlexIO device
 * param user_config pointer to flexio_config_s structure
 */

static void imxrt_flexio_init(struct flexio_dev_s *dev,
                              const struct flexio_config_s *user_config)
{
  imxrt_flexio_reset(dev);

  imxrt_flexio_modifyreg32(dev, IMXRT_FLEXIO_CTRL_OFFSET,
                      (FLEXIO_CTRL_DOZEN_MASK |
                       FLEXIO_CTRL_DBGE_MASK |
                       FLEXIO_CTRL_FASTACC_MASK |
                       FLEXIO_CTRL_FLEXEN_MASK),
                      (FLEXIO_CTRL_DBGE(user_config->enable_indebug) |
                       FLEXIO_CTRL_FASTACC(user_config->enable_fast_access) |
                       FLEXIO_CTRL_FLEXEN(user_config->enable_flexio)));

  if (!user_config->enable_indoze)
    {
      imxrt_flexio_modifyreg32(dev, IMXRT_FLEXIO_CTRL_OFFSET, 0,
                               FLEXIO_CTRL_DOZEN_MASK);
    }
}

/* Gets the default configuration to configure the FlexIO module.
 *
 * Example:
 * code
 * struct flexio_config_s config;
 * imxrt_flexio_get_default_config(&config);
 * endcode
 *
 * param user_config pointer to flexio_config_s structure
 */

static void imxrt_flexio_get_default_config(
              struct flexio_config_s *user_config)
{
  DEBUGASSERT(user_config != NULL);

  memset(user_config, 0, sizeof(*user_config));

  user_config->enable_flexio      = true;
  user_config->enable_indoze      = false;
  user_config->enable_indebug     = true;
  user_config->enable_fast_access = false;
}

/* Gets the shifter buffer address for the DMA transfer usage.
 *
 * param dev FlexIO peripheral dev address
 * param type Shifter type of enum flexio_shifter_buffer_type_e
 * param index Shifter index
 * return Corresponding shifter buffer address
 */

static uint32_t imxrt_flexio_get_shifter_buffer_address(
                  struct flexio_dev_s *dev,
                  enum flexio_shifter_buffer_type_e type, uint8_t index)
{
  uint32_t address = 0;

  UNUSED(dev);

  DEBUGASSERT(index < FLEXIO_SHIFTBUF_COUNT);

  switch (type)
    {
    case FLEXIO_SHIFTER_BUFFER:
      address = (uint32_t)(((struct imxrt_flexiodev_s *)dev)->base +
                           IMXRT_FLEXIO_SHIFTBUF0_OFFSET + index * 0x4);
      break;

    case FLEXIO_SHIFTER_BUFFER_BIT_SWAPPED:
      address = (uint32_t)(((struct imxrt_flexiodev_s *)dev)->base +
                           IMXRT_FLEXIO_SHIFTBUFBIS0_OFFSET + index * 0x4);
      break;

    case FLEXIO_SHIFTER_BUFFER_BYTE_SWAPPED:
      address = (uint32_t)(((struct imxrt_flexiodev_s *)dev)->base +
                           IMXRT_FLEXIO_SHIFTBUFBYS0_OFFSET + index * 0x4);
      break;

    case FLEXIO_SHIFTER_BUFFER_BIT_BYTE_SWAPPED:
      address = (uint32_t)(((struct imxrt_flexiodev_s *)dev)->base +
                           IMXRT_FLEXIO_SHIFTBUFBBS0_OFFSET + index * 0x4);
      break;

    case FLEXIO_SHIFTER_BUFFER_NIBBLE_BYTE_SWAPPED:
      address = (uint32_t)(((struct imxrt_flexiodev_s *)dev)->base +
                           IMXRT_FLEXIO_SHIFTBUFNBS0_OFFSET + index * 0x4);
      break;

    case FLEXIO_SHIFTER_BUFFER_HALF_WORD_SWAPPED:
      address = (uint32_t)(((struct imxrt_flexiodev_s *)dev)->base +
                           IMXRT_FLEXIO_SHIFTBUFHWS0_OFFSET + index * 0x4);
      break;

    case FLEXIO_SHIFTER_BUFFER_NIBBLE_SWAPPED:
      address = (uint32_t)(((struct imxrt_flexiodev_s *)dev)->base +
                           IMXRT_FLEXIO_SHIFTBUFNIS0_OFFSET + index * 0x4);
      break;

    default:
      address = (uint32_t)(((struct imxrt_flexiodev_s *)dev)->base +
                           IMXRT_FLEXIO_SHIFTBUF0_OFFSET + index * 0x4);
      break;
    }

  return address;
}

/****************************************************************************
 * Name: imxrt_flexio_initialize
 *
 * Description:
 *   Initialize the selected FlexIO port in master mode
 *
 * Input Parameters:
 *   intf - Interface number(must be zero)
 *
 * Returned Value:
 *   Valid FlexIO device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct flexio_dev_s *imxrt_flexio_initialize(int intf)
{
  struct imxrt_flexiodev_s *priv;
  struct flexio_config_s flexio_config;

  switch (intf)
    {
#ifdef CONFIG_IMXRT_FLEXIO1
    case 1:
      priv = &g_flexio1_dev;
      imxrt_clockall_flexio1();
      break;
#endif
#ifdef CONFIG_IMXRT_FLEXIO2
    case 2:
      priv = &g_flexio2_dev;
      imxrt_clockall_flexio2();
      break;
#endif
#ifdef CONFIG_IMXRT_FLEXIO3
    case 3:
      priv = &g_flexio3_dev;
      imxrt_clockall_flexio2();
      break;
#endif
    default:
      return NULL;
    }

  /* Has the FlexSPI hardware been initialized? */

  if (!priv->initialized)
    {
      /* Now perform one time initialization */

      /* Perform hardware initialization. Puts the FlexIO into an active
       * state.
       */

      imxrt_flexio_get_default_config(&flexio_config);
      imxrt_flexio_init((struct flexio_dev_s *)priv, &flexio_config);

      /* Enable interrupts at the NVIC */

      priv->initialized = true;
    }

  return &priv->flexio;
}

#endif /* CONFIG_IMXRT_FLEXIO */
